learning_in_gifs_app_api/app/controllers/gifs_controller.rb

  def index
    @gifs = Gif.all
---
SELECT "gifs".* FROM "gifs"