learning_in_gifs_app_api/app/controllers/gifs_controller.rb

SELECT "gifs".* FROM "gifs" WHERE "gifs"."category" = $1  [["category", "programming"]]
---
  def index
   @category= Gif.where({category: params[:category]})

INSERT INTO "gifs" ("name", "description", "category", "gif_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "work"], ["description", "work"], ["category", "work"], ["gif_url", "msn.com"], ["created_at", "2020-09-25 21:51:16.302400"], ["updated_at", "2020-09-25 21:51:16.302400"]]
---
  def create
    @gif = Gif.new(gif_params)

    if @gif.save